# ParameterMapIterator Properties

---
The ParameterMapIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Key| Retrieves the key that is the current focus of the iterator.
Top
#### Reference
ParameterMapIterator Class
Autodesk.Revit.DB Namespace